my_string = (str(input()))  # переменной присвоена строка с вводом символов
a = (my_string.count(''))  # переменной - (a), присвоен подсчёт символов с введёных символов
print(a - 1)  # вывести на экран переменную - (a) c вычетом 1
print(my_string.upper())  # вывести на экран переменную (my_string) в верхнем регистре
print(my_string.lower())  # вывести на экран переменную (my_string) в нижнем регистре
print(my_string.replace(' ', ''))  # вывести на экран переменную (my_string) и поменять пробел не на что
print(my_string[0])  # вывести на экран первый символ переменной (my_string)
print(my_string[-1])  # вывести на экран последний символ переменной (my_string)
